In [2]:
import pandas as pd

In [3]:
pd.Series([1, 2, 3, 4, 5], name="a")

0    1
1    2
2    3
3    4
4    5
Name: a, dtype: int64

In [6]:
data = pd.Series([1, 2, 3, 4, 5], name="n", index=[1, 2, 3, 4, 5])

In [9]:
data[1]

1

In [10]:
data.index

Index([1, 2, 3, 4, 5], dtype='int64')

In [26]:
dat = pd.DataFrame(
    {
        "A": [1, 2, 3, 4],
        "B": [1, 2, 4, 5],
        "C": [1, 2, 3, 4],
    }
)

In [12]:
dat

   A  B  C
0  1  1  1
1  2  2  2
2  3  3  3
3  4  4  4

In [14]:
dat["A"]

0    1
1    2
2    3
3    4
Name: A, dtype: int64

In [17]:
dat.iloc[0]

A    1
B    1
C    1
Name: 0, dtype: int64

In [18]:
dat.iloc[:, 0]

0    1
1    2
2    3
3    4
Name: A, dtype: int64

In [19]:
dat.iloc[:]

   A  B  C
0  1  1  1
1  2  2  2
2  3  3  3
3  4  4  4

In [27]:
s1 = pd.Series([2, 4, 6, 8, 10])

s2 = pd.Series([1, 3, 5, 7, 10])

s1 > s2

0     True
1     True
2     True
3     True
4    False
dtype: bool